<template>
    <div>
        <div
            class="line1"
        >从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存</div>
        <div
            class="line3"
        >从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存从指定资源请求数据，只用于取回数据，安全系数低（名称/值对，是在url中发送的），不应处理敏感数据，有长度限制，GET 请求可被缓存</div>
    </div>
</template>
<script>
export default {};
</script>
<style lang="less" scoped>
.line1 {
    // white-space: pre-wrap; //保留空格换行
    // word-break: break-all; //允许在单词内换行
    overflow: hidden;
    text-overflow: ellipsis;
    white-space: nowrap;
    margin: 30px;
}
.line3 {
    margin: 30px;
    // white-space: pre-wrap; //保留空格换行
    // word-break: break-all; //允许在单词内换行
    overflow: hidden;
    text-overflow: ellipsis;
    display: box;
    display: -moz-box;
    display: -o-box;
    display: -webkit-box;
    line-clamp: 3; //显示10行
    -webkit-line-clamp: 3; //显示10行
    -moz-line-clamp: 3; //显示10行
    -o-line-clamp: 3; //显示10行
    box-orient: vertical;
    -webkit-box-orient: vertical;
    -moz-box-orient: vertical;
    -o-box-orient: vertical;
}
</style>